; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-1-1-1-8-2-8) (:domain depots)
(:objects
	depot0 - Depot
	distributor0 - Distributor
	truck0 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 - Crate
	hoist0 hoist1 - Hoist)
(:init
	(at pallet0 depot0)
	(clear crate1)
	(at pallet1 distributor0)
	(clear crate2)
	(at pallet2 depot0)
	(clear crate4)
	(at pallet3 distributor0)
	(clear crate5)
	(at pallet4 depot0)
	(clear pallet4)
	(at pallet5 depot0)
	(clear pallet5)
	(at pallet6 distributor0)
	(clear crate3)
	(at pallet7 distributor0)
	(clear crate7)
	(at truck0 distributor0)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 distributor0)
	(available hoist1)
	(at crate0 depot0)
	(on crate0 pallet0)
	(at crate1 depot0)
	(on crate1 crate0)
	(at crate2 distributor0)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 pallet6)
	(at crate4 depot0)
	(on crate4 pallet2)
	(at crate5 distributor0)
	(on crate5 pallet3)
	(at crate6 distributor0)
	(on crate6 pallet7)
	(at crate7 distributor0)
	(on crate7 crate6)
)

(:goal (and
		(on crate0 pallet2)
		(on crate1 crate7)
		(on crate2 pallet1)
		(on crate3 pallet5)
		(on crate4 pallet7)
		(on crate5 pallet6)
		(on crate6 crate4)
		(on crate7 pallet3)
	)
))

; plan
1. (lift hoist1 crate3 pallet6 distributor0)
   deleted: (at crate3 distributor0) (available hoist1) (on crate3 pallet6) (clear crate3)
   added: (lifting hoist1 crate3) (clear pallet6)
   goals met: 1 of 8
2. (load hoist1 crate3 truck0 distributor0)
   deleted: (lifting hoist1 crate3)
   added: (in crate3 truck0) (available hoist1)
   goals met: 1 of 8
3. (lift hoist1 crate5 pallet3 distributor0)
   deleted: (at crate5 distributor0) (available hoist1) (on crate5 pallet3) (clear crate5)
   added: (lifting hoist1 crate5) (clear pallet3)
   goals met: 1 of 8
4. (drop hoist1 crate5 pallet6 distributor0)
   deleted: (lifting hoist1 crate5) (clear pallet6)
   added: (at crate5 distributor0) (available hoist1) (on crate5 pallet6) (clear crate5)
   goals met: 2 of 8
5. (lift hoist1 crate7 crate6 distributor0)
   deleted: (at crate7 distributor0) (available hoist1) (on crate7 crate6) (clear crate7)
   added: (lifting hoist1 crate7) (clear crate6)
   goals met: 2 of 8
6. (drop hoist1 crate7 pallet3 distributor0)
   deleted: (lifting hoist1 crate7) (clear pallet3)
   added: (at crate7 distributor0) (available hoist1) (on crate7 pallet3) (clear crate7)
   goals met: 3 of 8
7. (lift hoist0 crate4 pallet2 depot0)
   deleted: (at crate4 depot0) (available hoist0) (on crate4 pallet2) (clear crate4)
   added: (lifting hoist0 crate4) (clear pallet2)
   goals met: 3 of 8
8. (drive truck0 distributor0 depot0)
   deleted: (at truck0 distributor0)
   added: (at truck0 depot0)
   goals met: 3 of 8
9. (load hoist0 crate4 truck0 depot0)
   deleted: (lifting hoist0 crate4)
   added: (in crate4 truck0) (available hoist0)
   goals met: 3 of 8
10. (unload hoist0 crate3 truck0 depot0)
   deleted: (available hoist0) (in crate3 truck0)
   added: (lifting hoist0 crate3)
   goals met: 3 of 8
11. (drop hoist0 crate3 pallet5 depot0)
   deleted: (lifting hoist0 crate3) (clear pallet5)
   added: (at crate3 depot0) (available hoist0) (on crate3 pallet5) (clear crate3)
   goals met: 4 of 8
12. (lift hoist0 crate1 crate0 depot0)
   deleted: (at crate1 depot0) (available hoist0) (on crate1 crate0) (clear crate1)
   added: (lifting hoist0 crate1) (clear crate0)
   goals met: 4 of 8
13. (load hoist0 crate1 truck0 depot0)
   deleted: (lifting hoist0 crate1)
   added: (in crate1 truck0) (available hoist0)
   goals met: 4 of 8
14. (lift hoist0 crate0 pallet0 depot0)
   deleted: (at crate0 depot0) (available hoist0) (on crate0 pallet0) (clear crate0)
   added: (lifting hoist0 crate0) (clear pallet0)
   goals met: 4 of 8
15. (drop hoist0 crate0 pallet2 depot0)
   deleted: (lifting hoist0 crate0) (clear pallet2)
   added: (at crate0 depot0) (available hoist0) (on crate0 pallet2) (clear crate0)
   goals met: 5 of 8
16. (drive truck0 depot0 distributor0)
   deleted: (at truck0 depot0)
   added: (at truck0 distributor0)
   goals met: 5 of 8
17. (unload hoist1 crate1 truck0 distributor0)
   deleted: (available hoist1) (in crate1 truck0)
   added: (lifting hoist1 crate1)
   goals met: 5 of 8
18. (drop hoist1 crate1 crate7 distributor0)
   deleted: (lifting hoist1 crate1) (clear crate7)
   added: (at crate1 distributor0) (available hoist1) (on crate1 crate7) (clear crate1)
   goals met: 6 of 8
19. (lift hoist1 crate6 pallet7 distributor0)
   deleted: (at crate6 distributor0) (available hoist1) (on crate6 pallet7) (clear crate6)
   added: (lifting hoist1 crate6) (clear pallet7)
   goals met: 6 of 8
20. (drop hoist1 crate6 crate2 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate2)
   added: (at crate6 distributor0) (available hoist1) (on crate6 crate2) (clear crate6)
   goals met: 6 of 8
21. (unload hoist1 crate4 truck0 distributor0)
   deleted: (available hoist1) (in crate4 truck0)
   added: (lifting hoist1 crate4)
   goals met: 6 of 8
22. (drop hoist1 crate4 pallet7 distributor0)
   deleted: (lifting hoist1 crate4) (clear pallet7)
   added: (at crate4 distributor0) (available hoist1) (on crate4 pallet7) (clear crate4)
   goals met: 7 of 8
23. (lift hoist1 crate6 crate2 distributor0)
   deleted: (at crate6 distributor0) (available hoist1) (on crate6 crate2) (clear crate6)
   added: (lifting hoist1 crate6) (clear crate2)
   goals met: 7 of 8
24. (drop hoist1 crate6 crate4 distributor0)
   deleted: (lifting hoist1 crate6) (clear crate4)
   added: (at crate6 distributor0) (available hoist1) (on crate6 crate4) (clear crate6)
   goals met: 8 of 8
